Autodesk.Revit.DB.FillGrid.GetPointLineZone(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV@)
Gets the index of fill grid line and the point on the grid line nearest to the input point.
point:
Input point.
nearestPoint:
The point on the grid line nearest to the input point.
Returns:
The index of fill grid line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.FillGrid.GetPointLineZone(Autodesk.Revit.DB.UV)
Gets the index of fill grid line closest to the input 2d point.
point:
Input point.
Returns:
The index of fill grid line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.FillGrid.IsEqual(Autodesk.Revit.DB.FillGrid)
Check if two fill grids are equal.
other:
The fill grid to be compared.
Returns:
True if the two fill grids are equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.FillGrid.SetSegments(System.Collections.Generic.IList{System.Double})
Sets the segments to the fill grid.
segArr:
The segments to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.FillGrid.Origin
Gets and sets the origin of the fill grid.
The origin of the fill grid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.FillGrid.#ctor(System.Double,System.Double)
Creates a simple fill grid with given angle and offset.
angle:
The angle.
offset:
The offset represents the spacing between the lines.
Since:
2012

Autodesk.Revit.DB.FillGrid.#ctor(Autodesk.Revit.DB.FillGrid)
Constructs a new FillGrid with default settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012